Revit 2027 API
Document.GetRoomAtPoint Method
Gets a room containing the point.
Overload List
Name | Description
GetRoomAtPoint(XYZ) | Gets a room containing the point.
GetRoomAtPoint(XYZ, Phase) | Gets a room containing the point.
Top
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace